import { Metadata } from "next";
import Link from "next/link";

import PageWrapper from "@/components/page-wrapper";
import { formatPhoneNumber } from "@/lib/utils";

export const metadata: Metadata = {
  title: "Политика на поверителност",
};

export default function PrivacyPolicy() {
  return (
    <PageWrapper>
      <main className="min-h-screen">
        <h1 className="text-2xl font-semibold py-10 text-center">
          Политика на поверителност
        </h1>
        <div className="container mx-auto space-y-5 p-5 mb-10 rounded bg-black text-lg">
          <p>Последна актуализация: 17.02.2025</p>
          <p>
            Тази Политика на поверителност важи за всички посетители на нашия
            уебсайт, както и за всички потребители, които взаимодействат с него.
            С използването на нашия сайт, Вие се съгласявате с практиките,
            описани в тази Политика за поверителност.
          </p>
          <h2 className="text-2xl font-semibold my-5">1. Лична информация</h2>
          <ul className="list-disc ml-10 space-y-5">
            <li>
              <strong>Не събираме лични данни</strong>:
              <p>
                Нашият уебсайт не извършва автоматично събиране, обработка или
                съхранение на лични данни като име, имейл адрес, телефонен
                номер, адрес или друга информация, която би могла да Ви
                идентифицира.
              </p>
            </li>
            <li>
              <strong>Доброволно предоставяне на информация</strong>:
              <p>
                В случай, че решите доброволно да споделите лична информация
                чрез специално създадени форми (например, чрез контактна форма),
                тази информация ще бъде използвана единствено за целите, за
                които е предоставена (като отговор на запитване или предоставяне
                на информация за услугите ни). Обърнете внимание, че такива
                ситуации са изключение и не са част от рутинното функциониране
                на нашия сайт.
              </p>
            </li>
          </ul>
          <h2 className="text-2xl font-semibold my-5">
            2. Използване на бисквитки
          </h2>
          <p>
            Нашият уебсайт използва само необходимите бисквитки, които са от
            съществено значение за правилната работа и функционалността на
            сайта. Те не събират никаква лична информация и служат за поддържане
            на сесията на потребителя и осигуряване на гладко потребителско
            изживяване. Подробна информация за използваните бисквитки може да
            намерите в нашата{" "}
            <Link
              href={"/cookie-pilicy"}
              className="hover:underline hover:text-blue-500"
            >
              Политика за бисквитките
            </Link>
            .
          </p>
          <h2 className="text-2xl font-semibold my-5">3. Трети страни</h2>
          <ul className="list-disc ml-10 space-y-2">
            <li>
              <strong>Връзки към други уебсайтове</strong>:
              <p>
                Нашият уебсайт може да съдържа връзки към други уебсайтове,
                които не са под контрола на Тапицер Експрес. Ние не носим
                отговорност за практиките по поверителност на тези сайтове и Ви
                препоръчваме да прегледате техните политики за поверителност при
                посещение.
              </p>
            </li>
            <li>
              <strong>Услуги от външни доставчици</strong>:
              <p>
                В случай, че някога използваме външни услуги (например за
                хостинг или анализ), ще се уверим, че доставчиците спазват
                съответните стандарти за защита на данните. Все пак, тъй като не
                събираме лични данни, тази ситуация е минимална.
              </p>
            </li>
          </ul>
          <h2 className="text-2xl font-semibold my-5">
            4. Сигурност на данните
          </h2>
          <p>
            Ние предприемаме технически и организационни мерки, за да осигурим
            сигурността на информацията, дори ако тя не включва лични данни.
            Нашата цел е да защитим целостта и наличността на данните, с които
            работим, и да предотвратим неоторизиран достъп или разкриване.
          </p>
          <h2 className="text-2xl font-semibold my-5">
            5. Права на потребителите
          </h2>
          <p>
            Понеже не събираме лични данни, въпросите, свързани с достъпа,
            корекцията или изтриването на лична информация, не са приложими. Ако
            обаче имате въпроси относно тази Политика за поверителност или
            практиките ни по отношение на личните данни, моля, не се колебайте
            да се свържете с нас.
          </p>
          <h2 className="text-2xl font-semibold my-5">
            6. Промени в Политиката за поверителност
          </h2>
          <p>
            Ние си запазваме правото да актуализираме тази Политика за
            поверителност по всяко време, като публикуваме актуализираната
            версия на тази страница. Препоръчваме Ви периодично да проверявате
            тази страница, за да сте информирани за последните промени.
          </p>
          <h2 className="text-2xl font-semibold my-5">
            7. Информация за контакти
          </h2>
          <ul className="list-disc ml-10 space-y-2">
            <li>Имейл: {process.env.ADMIN_SUPPORT_EMAIL}</li>
            <li>
              Телефон:{" "}
              {formatPhoneNumber(process.env.ADMIN_SUPPORT_PHONE as string)}
            </li>
            <li>Име: Кристиан Костадинов</li>
          </ul>
          <p>
            С използването на нашия уебсайт, Вие се съгласявате с условията,
            описани в тази Политика за поверителност. Ако не сте съгласни с нея,
            моля, въздържайте се от използването на нашия сайт или се свържете с
            нас за допълнителна информация.
          </p>
        </div>
      </main>
    </PageWrapper>
  );
}
