import { Metadata } from "next";
import Link from "next/link";

import PageWrapper from "@/components/page-wrapper";
import { formatPhoneNumber } from "@/lib/utils";

export const metadata: Metadata = {
  title: "Политика на поверителност",
};

export default function PrivacyPolicy() {
  return (
    <PageWrapper>
      <main className="min-h-screen">
        <h1 className="text-2xl font-semibold py-10 text-center">
          Общи условия
        </h1>
        <div className="container mx-auto space-y-5 p-5 mb-10 rounded bg-black text-lg">
          <p>Последна актуализация: 17.02.2025</p>
          <p>
            Тези Общи условия уреждат използването на уебсайта на{" "}
            <Link href={"/"}>izrabotka-na-sayt.com</Link> Моля, прочетете
            внимателно тези условия, преди да използвате нашия уебсайт за услуги
            по изработка на сайтове и уеб приложения. С достъпа до и
            използването на нашия уебсайт, вие се съгласявате с настоящите Общи
            условия. Ако не сте съгласни с някои от частите им, моля, напуснете
            сайта.
          </p>
          <h2 className="text-2xl font-semibold my-5">1. Въведение</h2>
          <ol className="list-decimal ml-10 space-y-5">
            <li>
              Този уебсайт предоставя информация за изработка на сайтове и уеб
              приложения, които предлагаме.
            </li>
            <li>
              Ние се стремим да осигурим точна и актуална информация, но не
              можем да гарантираме пълнотата, точността или актуалността на
              съдържанието.
            </li>
          </ol>
          <h2 className="text-2xl font-semibold my-5">
            2. Приемане на условията
          </h2>
          <ol className="list-decimal ml-10 space-y-5">
            <li>
              С достъпа и използването на нашия уебсайт, вие автоматично се
              съгласявате с настоящите Общи условия.
            </li>
            <li>
              Запазваме правото да променяме или актуализираме тези условия по
              всяко време, като промените ще бъдат публикувани на тази страница.
              Препоръчваме ви редовно да проверявате за актуализации.
            </li>
          </ol>
          <h2 className="text-2xl font-semibold my-5">
            3. Интелектуална собственост
          </h2>
          <ol className="list-decimal ml-10 space-y-5">
            <li>
              Всички текстове, изображения, графики, лога, видео материали и
              друг тип съдържание, публикувано на този уебсайт, са собственост
              на <Link href={"/"}>izrabotka-na-sayt.com</Link> или на техните
              уважавани притежатели на авторски права.
            </li>
            <li>
              Забранява се копирането, възпроизвеждането или използването на
              съдържанието без изричното писмено съгласие от наша страна, освен
              ако не е изрично разрешено от Закона.
            </li>
          </ol>
          <h2 className="text-2xl font-semibold my-5">
            4. Условия за използване на сайта
          </h2>
          <ol className="list-decimal ml-10 space-y-5">
            <li>
              <strong>Достъп и използване</strong>:
              <p>
                Използването на уебсайта е позволено за лични, некомерсиални
                цели. Забранено е използването му за каквито и да е незаконни
                или неразрешени цели.
              </p>
            </li>
            <li>
              <strong>Промени в съдържанието</strong>:
              <p>
                Въпреки че се стремим съдържанието да бъде актуално и точно, не
                носим отговорност за грешки или пропуски. Съдържанието може да
                бъде променяно без предварително уведомление.
              </p>
            </li>
          </ol>
          <h2 className="text-2xl font-semibold my-5">
            5. Ограничаване на отговорността
          </h2>
          <ol className="list-decimal ml-10 space-y-5">
            <li>
              <strong>Без гаранции</strong>:
              <p>
                Уебсайтът се предоставя &quot;такъв, какъвто е&quot;, без каквито и да е
                изрични или подразбиращи се гаранции. Ние не гарантираме, че
                сайтът ще бъде непрекъснат, без грешки или сигурен от вируси и
                други вредни компоненти.
              </p>
            </li>
            <li>
              <strong>Отказ от отговорност</strong>:
              <p>
                Нито <Link href={"/"}>izrabotka-na-sayt.com</Link>, нито
                неговите служители, партньори или доставчици не поемат
                отговорност за каквито и да е щети, произтичащи от използването
                или невъзможността за използване на този уебсайт.
              </p>
            </li>
          </ol>
          <h2 className="text-2xl font-semibold my-5">
            6. Връзки към трети страни
          </h2>
          <ol className="list-decimal ml-10 space-y-5">
            <li>
              Нашият уебсайт може да съдържа връзки към външни сайтове, които не
              са под контрола на &quot;<Link href={"/"}>izrabotka.na-sayt.com</Link>
              &quot;.
            </li>
            <li>
              Ние не носим отговорност за съдържанието, политиките за
              поверителност или практиките на тези сайтове. Препоръчваме ви да
              прегледате общите условия и политиките за поверителност на всеки
              външен сайт, който посещавате.
            </li>
          </ol>
          <h2 className="text-2xl font-semibold my-5">
            7. Събиране на лични данни
          </h2>
          <ol className="list-decimal ml-10 space-y-5">
            <li>
              Нашият уебсайт не събира лични данни от потребителите, освен в
              случаите, когато това е изрично посочено и доброволно предоставено
              чрез специални форми (например, контактна форма).
            </li>
            <li>
              В случай че доброволно предоставите лична информация, тя ще бъде
              използвана единствено за целите, за които сте я предоставили, и ще
              бъде защитена в съответствие с приложимото законодателство.
            </li>
          </ol>
          <h2 className="text-2xl font-semibold my-5">
            8. Информация за контакти
          </h2>
          <ul className="list-disc ml-10 space-y-2">
            <li>Имейл: {process.env.ADMIN_SUPPORT_EMAIL}</li>
            <li>
              Телефон:{" "}
              {formatPhoneNumber(process.env.ADMIN_SUPPORT_PHONE as string)}
            </li>
            <li>Име: Кристиан Костадинов</li>
          </ul>
        </div>
      </main>
    </PageWrapper>
  );
}
